{
    "AI/ML Image Classification | Handlebars": "Clasificación de Imagen AI / ML | Handlebars",
    "AI/ML Image Classification | Vue": "Clasificación de Imagen AI / ML | Vue",
    "AI/ML Image Classification | React": "Clasificación de Imagen AI / ML | React",
    "Images": "Imágenes",
    "Categories": "Categorias",
    "Image Prediction Demo": "Demostración de Predicción de Imagen",
    "Info": "Informacion",
    "Uploading...": "Subiendo ...",
    "Loading...": "Cargando...",
    "Error": "Error",
    "{totalCount} Image Categories": "{totalCount} Categorías de Imagen",
    "Showing {displayCount} of {totalCount} Image Categories": "Mostrando {displayCount} de {totalCount} Categorías de Imagen",
    "Enter filter, example [dog] or [cat]": "Introduzca filtro, ejemplo [perro] o [gato]",
    "Image Classification Info": "Información de clasificación de imagen",
    "Overview": "Visión general",
    "Links": "Enlaces web",
    "info_1": "AI = Inteligencia Artificial / ML = Machine Learning",
    "info_2": "Esta página muestra cómo extender una página de servicio web JSON con DataFormsJS para incluir código JavaScript personalizado.",
    "info_3": "Esta página descarga imágenes de muestra y resultados de un servicio JSON y permite realizar predicciones a partir de la carga de imágenes al servicio web de clasificación de imágenes AI / ML creado con Python usando Keras y TensorFlow.",
    "info_4": "Cuando cargue una imagen, se comparará con 1,000 categorías diferentes; si se carga una imagen que no coincide con una de las categorías, los resultados pueden ser inexactos porque el modelo solo puede coincidir con las categorías conocidas. Por ejemplo, una foto de un delfín puede clasificarse con probabilidad media como un gran tiburón blanco.",
    "info_5": "Idealmente, el elemento principal de la imagen deberá estar en el centro y en el foco de la foto; de lo contrario, los resultados serán menos precisos.",
    "info_6": "Las imágenes que cargue son privadas solo para usted y se eliminan del servidor tan pronto como se procesan.",
    "info_7": "Las predicciones tardan un poco, así que espere 1 segundo o más por imagen que Ud. suba.",
    "info_8": "El modelo utilizado para la clasificación de imágenes es ResNet50 que utiliza pesos ImageNet pre-entrenados. ResNet50 es una red neuronal convolucional bien conocida y ampliamente utilizada para la clasificación de imágenes.",
    "info_9": "Las páginas de demostración creadas con Handlebars y Vue definen una página personalizada [imagePredictionPage] en [image-class.js] que extiende el objeto de página central [jsonData.js]. Cuando se utiliza el Framework DataFormsJS, este es un método común y recomendado para agregar JavaScript personalizado a los servicios web existentes.",
    "info_10": "La demostración React define componentes de página personalizados en [image-home-react.jsx]. El componente de página personalizado <ShowImages> se usa para <JsonData>.[isLoaded] y actualiza los datos después de descargarlos configurando el estado del componente <JsonData> al llamar a [props.handleChange()]. Además, debido a que [loadOnlyOnce = {true}] se usa para el servicio web, el estado está vinculado a la URL y los datos se descargan solo una vez. El estado de la página principal se mantendrá en la memoria si se navega a otra página y luego se mostrará nuevamente al hacer clic en Atrás.",
    "info_11": "Foto de Panda por Jay Wennington en Unsplash",
    "info_12": "Foto de esquí y montaña por Samuel Ferrara en Unsplash",
    "prob_high": ">= 67% de probabilidad",
    "prob_med": ">= 33% y < 67%",
    "prob_low": "< 33% de probabilidad"
}
